org/jpacheco.xyz.org
#+title: jpachecoxyz.github.io
#+author: Javier Pacheco
#+description: My website wrapped in an org file.
#+hugo_base_dir: ../
#+startup: content
#+hugo_custom_front_matter: toc true
#+hugo_auto_set_lastmod: nil
#+date: 2024-07-04
#+tags: blog(b) emacs(e) linux(l) personal(p) script(s) tecnology(t) wayland(w) work(W)
#+seq_todo: TODO(t) WAIT(w@/!) | DONE(d!)

** DONE A job history.                                       :blog:personal:
CLOSED: [2024-11-18 Mon 09:06]
:PROPERTIES:
:EXPORT_FILE_NAME: a-job-history
:EXPORT_DESCRIPTION: My job as an automation tech is over, this is what I think about it.
:DATE: [2024-09-06 Fri]
:EXPORT_HUGO_SECTION: posts
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2024-11-18 Mon 09:06]
:END:

*** A brief Introduction.
This is no t going to be a post about programming or technology, this is kind of a way to express my feelings about one important thing that I think is going to change my life, I'm talking about my job and how this ambient change my mind and my vision about this important thing that a lot of us need to do and hold the job pressure to keep some security for our families.

*** The history...
I have almost 5 years working in =Autoliv= in H.Matamoros, in the meaning of that time I was trying every single day to make my best, trying to improve things, make the process better, being the fastest troubleshooting solver, have less machines failures, less downtime, questioning about how maintenance can be better, and more thing related to the maintenance department.

As you may wonder, yes, I am a maintenance technician in the die-cast area, I always though that for require something you need to share something first, so that was basically what I was doing for about 4 years, mean while in those years, I prof myself, and prof others that I was capable to have an engineering position, because I was doing some specific tasks and covering the Controls Engineer when he was out of the job, develop projects, etc, all of that being a maintenance technician. So with that being said, I apply to various engineering vacancy's, but for one reason I never have been promoted, always have other person or the manager cancel the vacant. 

That's the =why= I realize that I don't need to effort my self to achieve something that is not going  to happens. So I decide to only do the job for what I was hired (maintenance technician). 

In the past 4 and a half years, I think I was doing a good job, not because I say it, my boss say it, the engineering department say it, the production department trust in my skills as a troubleshooting resolver. So at that time I was thinking that if I was doing a “good” job, maybe it could be easy to achieve some engineering charge, the thing is that I was =wrong=. It seems that being good and give some extra skills to the job were not enough. job, maybe it could be easy to achieve some engineering charge, the thing is that I was =wrong=. It seems that be good and give some extra skills to the job were not enough.

To the time, I decided to apply to a engineering position, so I do, I have a couple of interviews with the managers, but unfortunately, they choose other person, or canceled the job position. That basically drop me down, because It was kind of I don't know, It seems that I'm was good, but not enough, some times when I fill the job when the control's engineer was out of the job, I have treat with others engineers, but I don't want to say bad things about them, but in my perspective, those engineers are too young and with a lack of experience, don't let me wrong, but is I went messed up when those guys came to me and ask me for directions, while technically I am a low level in the structure:
#+begin_quote
Engineer > Technician
#+end_quote

So I remember that day, I returned to my home so mad and sad, Why?, a few weeks before, I was working in the first shift, everything goes fine, I have like 5 months since I was returned to the first shift;
#+begin_quote
Long short history: As a technician with the “strength” of programming, I must be in other shift because in the first shift was the main programming engineer.
#+end_quote

Of course for me that was pointless, because I don't have nothing  to do with the engineer, because I am a technician. So that day my boss came to my position and say that I need to move to the 2nd shift, because he need some one that cover the automation issues in the area, and I am the only technician with the knowledge (blah, blah, blah...)
*** The end.
Months later, I feel not 
comfortable, with my job, at that point I feel messy, I don't want to go in there, not because laziness, but because I lost the feeling, I don't know how to describe it.

To my fortune, I have an job interview for the maintenance supervisor roll in another DieCasting company here in H. Matamoros. And fortunately I was selected to have the job. Finally I ended quite my job, and start a new one now in a better roll and with more opportunities and new challenges to my personal and professional career.


