public/posts/a-job-history.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A job history.</title>
<meta name="generator" content="Org Mode" />
<!-- <link rel="stylesheet" type="text/css" href="/ox.css"/> -->
<link rel="stylesheet" type="text/css" href="/custom.css"/>
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=JetBrains+Mono" rel="stylesheet">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css">
<!-- copy org-blocks to clipboard  -->
</head>
<body>
<div id="preamble" class="status">
<hr style="border-top: 1px solid black;">
<div class='topnav' style='display: flex; justify-content: space-between; align-items: center;'>
  <h2 style='margin-top: 0; margin-bottom: 0; margin-left:0px;'>jpachecoxyz</h2> 
  <div>
    <a href='/index.html' style='font-weight:bold;'>Home</a> |
    <a href='/archive.html' style='font-weight:bold;'>Blog</a> | 
    <a href='/about.html' style='font-weight:bold;'>About Me</a> | 
	<a href="/rss.xml">
	  <i class="fas">&#xf09e;</i>
	</a>
  </div>
</div>
<hr style="border-top: 1px solid black;">
</div>
<div id="content" class="content">
<header>
<h1 class="title">A job history.</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6801545">A brief Introduction.</a></li>
<li><a href="#org84f9a7a">The history&#x2026;</a></li>
<li><a href="#org794be2c">The end.</a></li>
</ul>
</div>
</nav>
<p>

</p>
<div id="outline-container-org6801545" class="outline-2">
<h2 id="org6801545">A brief Introduction.</h2>
<div class="outline-text-2" id="text-org6801545">
<p>
This is no t going to be a post about programming or technology, this is kind of a way to express my feelings about one important thing that I think is going to change my life, I'm talking about my job and how this ambient change my mind and my vision about this important thing that a lot of us need to do and hold the job pressure to keep some security for our families.
</p>
</div>
</div>

<div id="outline-container-org84f9a7a" class="outline-2">
<h2 id="org84f9a7a">The history&#x2026;</h2>
<div class="outline-text-2" id="text-org84f9a7a">
<p>
I have almost 5 years working in <code>Autoliv</code> in H.Matamoros, in the meaning of that time I was trying every single day to make my best, trying to improve things, make the process better, being the fastest troubleshooting solver, have less machines failures, less downtime, questioning about how maintenance can be better, and more thing related to the maintenance department.
</p>

<p>
As you may wonder, yes, I am a maintenance technician in the die-cast area, I always though that for require something you need to share something first, so that was basically what I was doing for about 4 years, mean while in those years, I prof myself, and prof others that I was capable to have an engineering position, because I was doing some specific tasks and covering the Controls Engineer when he was out of the job, develop projects, etc, all of that being a maintenance technician. So with that being said, I apply to various engineering vacancy's, but for one reason I never have been promoted, always have other person or the manager cancel the vacant. 
</p>

<p>
That's the <code>why</code> I realize that I don't need to effort my self to achieve something that is not going  to happens. So I decide to only do the job for what I was hired (maintenance technician). 
</p>

<p>
In the past 4 and a half years, I think I was doing a good job, not because I say it, my boss say it, the engineering department say it, the production department trust in my skills as a troubleshooting resolver. So at that time I was thinking that if I was doing a “good” job, maybe it could be easy to achieve some engineering charge, the thing is that I was <code>wrong</code>. It seems that being good and give some extra skills to the job were not enough. job, maybe it could be easy to achieve some engineering charge, the thing is that I was <code>wrong</code>. It seems that be good and give some extra skills to the job were not enough.
</p>

<p>
To the time, I decided to apply to a engineering position, so I do, I have a couple of interviews with the managers, but unfortunately, they choose other person, or canceled the job position. That basically drop me down, because It was kind of I don't know, It seems that I'm was good, but not enough, some times when I fill the job when the control's engineer was out of the job, I have treat with others engineers, but I don't want to say bad things about them, but in my perspective, those engineers are too young and with a lack of experience, don't let me wrong, but is I went messed up when those guys came to me and ask me for directions, while technically I am a low level in the structure:
</p>
<blockquote>
<p>
Engineer &gt; Technician
</p>
</blockquote>

<p>
So I remember that day, I returned to my home so mad and sad, Why?, a few weeks before, I was working in the first shift, everything goes fine, I have like 5 months since I was returned to the first shift;
</p>
<blockquote>
<p>
Long short history: As a technician with the “strength” of programming, I must be in other shift because in the first shift was the main programming engineer.
</p>
</blockquote>

<p>
Of course for me that was pointless, because I don't have nothing  to do with the engineer, because I am a technician. So that day my boss came to my position and say that I need to move to the 2nd shift, because he need some one that cover the automation issues in the area, and I am the only technician with the knowledge (blah, blah, blah&#x2026;)
</p>
</div>
</div>
<div id="outline-container-org794be2c" class="outline-2">
<h2 id="org794be2c">The end.</h2>
<div class="outline-text-2" id="text-org794be2c">
<p>
Months later, I feel not 
comfortable, with my job, at that point I feel messy, I don't want to go in there, not because laziness, but because I lost the feeling, I don't know how to describe it.
</p>

<p>
To my fortune, I have an job interview for the maintenance supervisor roll in another DieCasting company here in H. Matamoros. And fortunately I was selected to have the job. Finally I ended quite my job, and start a new one now in a better roll and with more opportunities and new challenges to my personal and professional career.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-12-26 Thu 14:21</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
